In [1]:
import pandas as pd
import numpy as np

In [2]:
my_series = pd.Series(data=[2,3,4,5],
                     index=["a","b","c","d"])
print(my_series)

a    2
b    3
c    4
d    5
dtype: int64

In [3]:
my_dict={"x":2,"y":5,"b":4,"c":8}
my_series2=pd.Series(my_dict)
my_series2

x    2
y    5
b    4
c    8
dtype: int64

In [4]:
my_series["a"]

2

In [5]:
my_series+my_series

a     4
b     6
c     8
d    10
dtype: int64

In [6]:
my_series+ my_series2

a     NaN
b     7.0
c    12.0
d     NaN
x     NaN
y     NaN
dtype: float64

In [8]:
my_dict={'name':["Joe",'Bob',"Frans"],
        'age':np.array([10,15,20]),
        'weight':(75,123,239),
        "height":pd.Series([4.5,5,6.1],
                          index=["Joe","Bob","Frans"]),
        'siblings':1,
        "gender":"M"}
df=pd.DataFrame(my_dict)
df

        name  age  weight  height  siblings gender
Joe      Joe   10      75     4.5         1      M
Bob      Bob   15     123     5.0         1      M
Frans  Frans   20     239     6.1         1      M

In [9]:
df['weight']

Joe       75
Bob      123
Frans    239
Name: weight, dtype: int64

In [10]:
df.weight

Joe       75
Bob      123
Frans    239
Name: weight, dtype: int64

In [12]:
df["IQ"]=[130,105,115]
df

        name  age  weight  height  siblings gender   IQ
Joe      Joe   10      75     4.5         1      M  130
Bob      Bob   15     123     5.0         1      M  105
Frans  Frans   20     239     6.1         1      M  115

In [15]:
df["Married"]=False
df

        name  age  weight  height  siblings gender   IQ  Married
Joe      Joe   10      75     4.5         1      M  130    False
Bob      Bob   15     123     5.0         1      M  105    False
Frans  Frans   20     239     6.1         1      M  115    False

In [17]:
df.loc["Joe"]

name          Joe
age            10
weight         75
height        4.5
siblings        1
gender          M
IQ            130
Married     False
Name: Joe, dtype: object

In [21]:
df.iloc[2]

name        Frans
age            20
weight        239
height        6.1
siblings        1
gender          M
IQ            115
Married     False
Name: Frans, dtype: object

In [25]:
boolean_index=[False,True,True]
df

        name  age  weight  height  siblings gender   IQ  Married
Joe      Joe   10      75     4.5         1      M  130    False
Bob      Bob   15     123     5.0         1      M  105    False
Frans  Frans   20     239     6.1         1      M  115    False

In [24]:
df[boolean_index]

        name  age  weight  height  siblings gender   IQ  Married
Bob      Bob   15     123     5.0         1      M  105    False
Frans  Frans   20     239     6.1         1      M  115    False